     A
     A          R CONDETR                   PFILE(CONDET)
     A
     A          K XWABCD
     A          K XWAACS
     A          K XWORDN
