     A* ***********************************
     A          R RCUSF                     PFILE(CUSF      )
     A*
     A          K STATUS
     A          K CNAME
