     A          R PROJECR                   PFILE(PROJECT)
     A
     A          K XWAACS
     A          K XWABCD
     A          K XWFNDT
     A
     A          S XWJSTS                    COMP(NE 'C')
