     A          R PROJECR                   PFILE(PROJECT)
     A
     A          K XWORDN
     A          K XWABCD
     A          K XWJOBN
     A
