     A          R PROJECR                   PFILE(PROJECT)
     A
     A          K XWAGCD
     A          K XWABCD
     A          K XWJOBN
     A
     A          S XWJSTS                    COMP(NE 'C')
