     A          R PROTRKR                   PFILE(PROTRK)
     A
     A          K XWTRPT
     A          K XWPLDT
     A          K XWJOBN
     A          K XWSEQN
