     A
     A          R STKBALR                   PFILE(STKBAL)
     A
     A          K XWAGCD
     A          K XWAHCD
     A          K XWAICD
     A          K XWABCD
