     A
     A          R STKMASR                   PFILE(STKMAS)
     A
     A          K XWAGCD
     A          K XWAHCD
     A          K XWAICD
     A          K XWABCD
