     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A          K XWORDN
     A          K XWABCD
     A          K XWRICD
     A          K XWDLDT
