     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A
     A          K XWAGCD
     A          K XWAHCD
     A          K XWAICD
     A          K XWABCD
