     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A          K XWBDCD
     A          K XWABCD
     A          K XWE4NB
     A          K XWRICD
