     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A
     A          K XWBCCD
     A          K XWE4NB
     A          K XWRICD
