     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A          K XWABCD
     A          K XWAACS
     A          K XWE4NB
     A          K XWDLDT
