     A
     A          R TRNHSTR                   PFILE(TRNHST)
     A
     A          K PERSON
     A          K XWBCCD
     A          K XWABCD
