     A          R TSTPF1R
     A            FLD11          5P 0
     A            FLD12         10A
     A            FLD13         10A
     A            FLD14         10A
