                                            UNIQUE
     A          R TSTPF2R
     A            FLD21          5P 0
     A            FLD22         10A
     A            FLD23         10A
     A          K FLD21
