     A          R TSTPF3R
     A            FLD31          5P 0
     A            FLD32         10A
     A            FLD33         10A
     A            FLD34         10A
     A          K FLD31
