     FCUSFL3  IF  E           K        DISK
     F*CUSFL4  IF  E           K        DISK
     FCUSTS   O   E                    DISK
     E                    PK         10 50
     C           *ENTRY    PLIST
     C                     PARM           PK
     C                     MOVELPK,1      CUSNO
     C           CUSNO     CHAINCUSFL3               LR
     C  NLR                WRITECUSTSR
     C                     SETON                     LR
