             PGM        PARM(&PK)
             DCL        VAR(&PK) TYPE(*CHAR) LEN(500)

             CALL CSEC2
         /*  MONMSG     MSGID(CPF0000)   */

             ENDPGM
