/* ----------------------------------------------------------------- */
/*‚Parameters */
/* ----------------------------------------------------------------- */
             PGM        PARM(&MSGID &MSGTEXT)

/* ----------------------------------------------------------------- */
/*‚Declarations */
/* ----------------------------------------------------------------- */
             DCL        VAR(&MSGID)   TYPE(*CHAR) LEN(7)
/*           DCL        VAR(&TEXT) TYPE(*CHAR) LEN(132)              */
             DCL        VAR(&MSGTEXT) TYPE(*CHAR) LEN(132)

/* ----------------------------------------------------------------- */
/*‚Retrieve messgae text */
/* ----------------------------------------------------------------- */

             RTVMSG     MSGID(&MSGID) MSGF(XAN4CDEM/OEMSGF) +
                          MSG(&MSGTEXT)
             MONMSG     MSGID(CPF0000)

/* ----------------------------------------------------------------- */
             ENDPGM
/* ----------------------------------------------------------------- */
