             PGM        PARM(&PRM1)
/*‚----------------------------------------------------------------- */
             DCL        VAR(&PRM1) TYPE(*CHAR) LEN(11)
/*           DCL        VAR(&ACC1) TYPE(*CHAR) LEN(11)               */

             IF         COND(&PRM1 = ' ') THEN(DO)
                CHGVAR  VAR(&PRM1) VALUE(ACC1)
             ENDDO

             TRNHSTCMD  PARM1(&PRM1)

/*           MONMSG     MSGID(CPF0000)                               */
/*‚----------------------------------------------------------------- */
             ENDPGM
/*‚----------------------------------------------------------------- */
